src/InformationRegisters/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовМЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - наш GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметСообщения</name>
    <type>
      <types>DefinedType.ПредметСообщенияМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/УведомлениеМЭДО/УведомлениеМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ВерсияМЭДО</name>
    <comment>Хранится &quot;для истории&quot;, при отправке первична версия в настройках контрагента</comment>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовоКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходящегоСообщения</name>
    <comment>Для входящего уведомления</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Не более 2047 символов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомленийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправлениеДоклада</name>
    <comment>reportSent</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Опубликование</name>
    <comment>documentPublished</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПечатныйОрган</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказВРегистрации</name>
    <comment>documentRefused</comment>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВРегистрацииМЭДО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодготовкаДоклада</name>
    <comment>reportPrepared</comment>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПодписания</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль</name>
    <comment>documentSent</comment>
    <attributes>
      <name>ТребуетсяРегистрация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяИсполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПубликация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктыДокументаПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль_КонтрольныеПунктыДокумента</name>
    <attributes>
      <name>ИдентификаторПункта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПункта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПринятиеКИсполнению</name>
    <comment>executorAssigned</comment>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийИсполнителя</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяПодразделения</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяСекретаря</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделения</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделенияПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарь</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарьПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регистрация</name>
    <comment>documentAccepted</comment>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>DefinedType.РегистрационныйНомер</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХодИсполнения</name>
    <comment>courseChanged</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеХодаИсполнения</name>
      <comment>до 4000 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СостоянияДокументовМЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает таблицу состояний документов для различных ситуаций.
// 
// Параметры:
//  Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО,Неопределено - Направление, относящееся к документу,
//  																		а не к уведомлению или квитанции
//  																		в регистре состояний.
//  Поля - Строка - Поля регистра, через запятую, которые нужно получить, можно указать * - т.е. все поля.
//  				Можно получать поля через точку, т.е. передавать Поля, как часть запроса для ВЫБРАТЬ.
//  ДатаСреза - Дата - на какую получить состояние.
//  МассивСостояний - Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО, Неопределено - Массив состояний для отбора.
//  																					Если Неопределено, то любые.
//  МассивДокументов - Массив из ОпределяемыйТип.ПредметМЭДО, Неопределено - Массив документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состояний документов, могут быть не все колонки (если задан Поля):
//   * Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО -
//   * ПредметСообщения - ОпределяемыйТип.ПредметСообщенияМЭДО -
//   * Документ - ОпределяемыйТип.ПредметМЭДО -
//   * ИдентификаторДокумента - Строка -
//   * ИдентификаторСообщения - Строка -
//   * Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО -
Функция ПолучитьСрезСостоянияДокументов(
	Направление,
	Поля,
	ДатаСреза = Неопределено,
	МассивСостояний = Неопределено,
	МассивДокументов = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.СостоянияДокументовМЭДО.СрезПоследних(
		|		&ДатаСреза, Направление = &Направление И &ОтборПоДокументам) КАК Состояния
		|ГДЕ
		|	&ОтборПоСостояниям");
	Если ЗначениеЗаполнено(Направление) Тогда
		Запрос.УстановитьПараметр("Направление", Направление);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Направление = &Направление", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	// Удалим лишние колонки
	Если Поля <> "*" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Поля);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивДокументов) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "&ОтборПоДокументам", "Документ В (&МассивДокументов)");
		Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДокументам", "ИСТИНА");
	КонецЕсли;
	
	Если МассивСостояний <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "&ОтборПоСостояниям", "Состояния.Состояние В (&МассивСостояний)");
		Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСостояниям", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает состояние одного документа, "обертка" предыдущей функции.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - документ.
//  Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО, Неопределено - Направление, относящееся к документу,
//  																		а не к уведомлению или квитанции
//  																		в регистре состояний.
//  Поля - Строка - Поля регистра, через запятую, которые нужно получить, можно указать * - т.е. все поля.
//  				Можно получать поля через точку, т.е. передавать Поля, как часть запроса для ВЫБРАТЬ.
//  ДатаСреза - Дата - на какую получить состояние.
//  МассивСостояний - Неопределено, Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО - Массив состояний для отбора.
//  																					Если Неопределено, то любые.
// 
// Возвращаемое значение:
//  Структура - Состояние документа по срезу из регистра, если не найдено, то все поля = Неопределено.
//  						Поля структуры (если не задан Поля):
//   * Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО, Неопределено -
//   * Документ - ОпределяемыйТип.ПредметМЭДО -
//   * ИдентификаторДокумента - Строка -
//   * ИдентификаторСообщения - Строка -
//   * ПредметСообщения - ОпределяемыйТип.ПредметСообщенияМЭДО -
//   * Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО -
Функция ПолучитьСрезСостоянияДокумента(
	Документ, Направление, Поля, ДатаСреза, МассивСостояний) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ВызватьИсключение НСтр("ru = 'Не задан документ для получения состояния!'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.СостоянияДокументовМЭДО.СрезПоследних(
		|		&ДатаСреза, &ОтборНаправление И Документ = &Документ) КАК Состояния
		|ГДЕ
		|	&ОтборПоСостояниям");
	Если ЗначениеЗаполнено(Направление) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборНаправление", "Направление = &Направление");
		Запрос.УстановитьПараметр("Направление", Направление);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборНаправление", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	// Удалим лишние колонки
	Если Поля <> "*" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Поля);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Если МассивСостояний <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "&ОтборПоСостояниям", "Состояния.Состояние В (&МассивСостояний)");
		Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСостояниям", "ИСТИНА");
	КонецЕсли;
	
	Возврат МЭДОСтруктурыДанных.РезультатЗапросаВСтруктуру(Запрос.Выполнить());
	
КонецФункции

// Получить одно определенное состояние документа. Если в одном состоянии документ был несколько раз, то последнее.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - документ.
//  Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояние
//  Поля - Строка - Поля регистра, через запятую, которые нужно получить, если все поля, можно указать "*".
//  ДоДаты - Дата - Историю состояний проверять до этой даты.
// 
// Возвращаемое значение:
//  Структура - Поля структуры (если Поля = "*"):
//   * Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО -
//   * Документ - ОпределяемыйТип.ПредметМЭДО -
//   * ИдентификаторДокумента - Строка -
//   * ИдентификаторСообщения - Строка -
//   * ПредметСообщения - ОпределяемыйТип.ПредметСообщенияМЭДО -
//   * Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО -
Функция ПолучитьСостояниеДокумента(Документ, Состояние, Поля, ДоДаты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	РегистрСведений.СостоянияДокументовМЭДО КАК Состояния
		|ГДЕ
		|	Документ = &Документ И Состояние = &Состояние И Период <= &ДоДаты
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|УБЫВ");
	Если Поля <> "*" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Поля);
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДоДаты", ДоДаты);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	Возврат МЭДОСтруктурыДанных.РезультатЗапросаВСтруктуру(Запрос.Выполнить());

КонецФункции

// Получить историю состояний по документу для показа на форме документа.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ПредметСообщения - ОпределяемыйТип.ПредметСообщенияМЭДО
//   * Направление - ПеречислениеСсылка.НаправленияСообщенийМЭДО
//   * ИдентификаторСообщения - Строка
//   * ИдентификаторДокумента - Строка
//   * Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО
//   * ТипУведомления - ПеречислениеСсылка.ТипыУведомленийМЭДО
Функция ПолучитьИсториюСостоянийПоДокументу(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Состояния.Период,
		|	Состояния.ПредметСообщения,
		|	Состояния.ПредметСообщения.Направление КАК Направление,
		|	Состояния.ИдентификаторСообщения,
		|	Состояния.ИдентификаторДокумента,
		|	Состояния.Состояние,
		|	ВЫБОР
		|		КОГДА Состояния.ПредметСообщения ССЫЛКА Документ.УведомлениеМЭДО
		|			ТОГДА Состояния.ПредметСообщения.ТипУведомления
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыУведомленийМЭДО.ПустаяСсылка)
		|	КОНЕЦ КАК ТипУведомления
		|ИЗ
		|	РегистрСведений.СостоянияДокументовМЭДО КАК Состояния
		|ГДЕ
		|	Состояния.Документ = &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состояния.Период УБЫВ");
	Запрос.УстановитьПараметр("Документ", Документ);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
